[
    {
        "command": "ban",
        "message": "Este comando elimina a un usuario del grupo. Puedes usarlo de dos maneras:\n1. Respondiendo directamente al mensaje del usuario que deseas eliminar.\n2. Mencionando explícitamente al usuario junto con el comando.\n\nTambién puedes eliminar a todos usando <@ban @todos>\n\n*Importante*: El bot debe tener permisos de administrador en el grupo",
        "usage": "ban <user>"
    },
    {
        "command": "bot",
        "message": "Con este comando, puedes activar o desactivar la presencia y funcionalidad del bot dentro de tu grupo. Este comando te permite controlar cuando el bot interactúa con los miembros del grupo",
        "usage": "bot <on/off>"
    },
    {
        "command": "todos",
        "message": "¿Necesitas llamar la atención de todos en tu grupo? Este comando etiqueta a todos los miembros, facilitando la difusión de mensajes importantes o anuncios",
        "usage": "todos"
    },
    {
        "command": "del",
        "message": "Mantén tu grupo ordenado eliminando mensajes no deseados o inapropiados. Simplemente responde al mensaje que quieres eliminar con este comando, y ya.\n\n*Importante*: El bot debe tener permisos de administrador en el grupo",
        "usage": "del"
    },
    {
        "command": "join",
        "message": "Agrega al bot a tu grupo de WhatsApp y disfrutar de sus beneficios. Solo necesitas enviar este comando acompañado del enlace de invitación a tu grupo",
        "usage": "join https://chat.whatsapp.com/CODIGO"
    },
    {
        "command": "addgroup",
        "message": "Registra tu grupo con el bot para habilitar sus funcionalidades. Solo tienes que enviar este comando al grupo que deseas registrar",
        "usage": "addgroup"
    },
    {
        "command": "add",
        "message": "Añade a nuevos usuarios a tu grupo, hasta un máximo de 3 contactos. Responde a un mensaje que contenga el contacto de la persona que quieres añadir, y el bot se encargará del resto.\n\n*Importante*: El bot debe tener permisos de administrador en el grupo",
        "usage": "add"
    },
    {
        "command": "addpremium",
        "message": "Registra un nuevo usuario para el bot.\n\n*Importante*: Disponible solo para el propietario",
        "usage": "addpremium <user> <nombre> <dias>"
    },
    {
        "command": "promote",
        "message": "Haz que un usuario sea administrador del grupo. Puedes mencionarles o responder a uno de sus mensajes.\n\n*Importante*: El bot debe tener permisos de administrador en el grupo",
        "usage": "promote <user>"
    },
    {
        "command": "demote",
        "message": "Haz que un administrador pase a ser un usuario promedio. Puedes mencionarles o responder a uno de sus mensajes.\n\n*Importante*: El bot debe tener permisos de administrador en el grupo",
        "usage": "demote <user>"
    },
    {
        "command": "open",
        "message": "Abre tu grupo a la participación de todos los miembros, permitiendo que cualquiera pueda enviar mensajes.\n\n*Importante*: El bot debe tener permisos de administrador en el grupo",
        "usage": "open"
    },
    {
        "command": "close",
        "message": "Restringe la capacidad de enviar mensajes solo a los administradores, ideal para momentos donde necesitas controlar la conversación o evitar spam.\n\n*Importante*: El bot debe tener permisos de administrador en el grupo",
        "usage": "close"
    },
    {
        "command": "chat",
        "message": "Inicia una conversación con el bot. Puedes hablar de lo que quieras, y el bot te responderá. ¡Pruébalo!\n\n*Importante*: El bot solo reconocerá los mensajes enviados con <chat>",
        "usage": "chat <tu mensaje>"
    },
    {
        "command": "resumen",
        "message": "Obtén un resumen de los últimos 50 mensajes en el grupo",
        "usage": "resumen"
    },
    {
        "command": "imagine",
        "message": "Libera tu creatividad y pide al bot que imagine y genere una imagen por ti",
        "usage": "imagine <tu mensaje>"
    },
    {
        "command": "subscription",
        "message": "Te proporciona información detallada sobre tu suscripción. Incluye tu número de teléfono, la fecha de expiración de tu suscripción y la lista de grupos registrados con el bot",
        "usage": "subscription"
    },
    {
        "command": "global",
        "message": "Envía un mensaje a todos los usuarios de pago.\n\n*Importante*: Disponible solo para el propietario",
        "usage": "global <tu mensaje>"
    }
]
